In [6]:
# Import dependencies
import os
import csv
import pandas as pd
from pathlib import Path

In [7]:
# Import files
departments_path = os.path.join('data', 'departments.csv')
dept_emp_path = os.path.join('data', 'dept_emp.csv')
dept_manager_path = os.path.join('data', 'dept_manager.csv')
employees_path = os.path.join('data', 'employees.csv')
salaries_path = os.path.join('data', 'salaries.csv')
titles_path = os.path.join('data', 'titles.csv')

In [8]:
# Read files
departments = pd.read_csv(departments_path)
dept_emp = pd.read_csv(dept_emp_path)
dept_manager = pd.read_csv(dept_manager_path)
employees = pd.read_csv(employees_path)
salaries = pd.read_csv(salaries_path)
titles = pd.read_csv(titles_path)

In [19]:
# Review csv 1
departments.head(1)

  dept_no  dept_name
0    d001  Marketing

In [18]:
# Review csv 2
dept_emp.head(1)

   emp_no dept_no
0   10001    d005

In [17]:
# Review csv 3
dept_manager.head(1)

  dept_no  emp_no
0    d001  110022

In [16]:
# Review csv 4
employees.head(1)

   emp_no emp_title_id birth_date first_name last_name sex  hire_date
0  473302        s0001  7/25/1953   Hideyuki  Zallocco   M  4/28/1990

In [15]:
# Review csv 5
salaries.head(1)

   emp_no  salary
0   10001   60117

In [14]:
# Review csv 
titles.head(1)

  title_id  title
0    s0001  Staff